# -*- coding: utf-8 -*-
"""lvl_1/task_1.3.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1yCqiRKEQGDuFvFqXRXrC7uOhgF4R7qYi

# Задача 1.3.

# Напишите скрипт, который принимает от пользователя номер месяца,
# а возвращает количество дней в нем.
# Результат проверки вывести на консоль
# Допущение: в феврале 28 дней
# Если номер месяца некорректен - сообщить об этом

# Например,
    # Введите номер месяца: 3
    # Вы ввели март. 31 дней

    # Введите номер месяца: 2
    # Вы ввели февраль. 28 дней

    # Введите номер месяца: 15
    # Такого месяца нет!
"""



mes = {
    1: 'Январь - 31 день',
    2: 'Февраль - 28 дней',
    3: 'Март - 31 дней',
    4: 'Апрель - 30 дней',
    5: 'Май - 31 день',
    6: 'Июнь - 30 дней',
    7: 'Июль - 31 день',
    8: 'Август - 31 день',
    9: 'Сентябрь - 30 дней',
    10: 'Октябрь - 31 день',
    11: 'Ноябрь - 30 дней',
    12: 'Декабрь - 31 день',
}
x=int(input('Введите номер месяца:'))

while x>12 or x<1:
  x=int(input("ОШИБКА:число месяца должно быть от 1 до 12: "))

print('Месяц № ', x,' - ', mes[x])