# -*- coding: utf-8 -*-
"""lvl_1/task_1.2.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1ysL2f8ApFxUK5zeYXlxQZXNgUocjs8_5

# Задача 1.2.

# Пункт A.
# Приведем плейлист песен в виде списка списков
# Список my_favorite_songs содержит список названий и длительности каждого трека
# Выведите общее время звучания трех случайных песен в формате
# Три песни звучат ХХХ минут

my_favorite_songs = [
    ['Waste a Moment', 3.03],
    ['New Salvation', 4.02],
    ['Staying\' Alive', 3.40],
    ['Out of Touch', 3.03],
    ['A Sorta Fairytale', 5.28],
    ['Easy', 4.15],
    ['Beautiful Day', 4.04],
    ['Nowhere to Run', 2.58],
    ['In This World', 4.02],
]
"""

my_favorite_songs = [
    ['Waste a Moment', 3.03],
    ['New Salvation', 4.02],
    ['Staying Alive', 3.40],
    ['Out of Touch', 3.03],
    ['A Sorta Fairytale', 5.28],
    ['Easy', 4.15],
    ['Beautiful Day', 4.04],
    ['Nowhere to Run', 2.58],
    ['In This World', 4.02],]

import random
zz = random.sample(my_favorite_songs, k=3)
print('Список песен: ', zz)
gradient=zz
print('Три песни звучат: ',gradient[0][1],'+',gradient[1][1],'+',gradient[2][1],'=',round((gradient[0][1]+gradient[1][1]+gradient[2][1]),2),' минут')

print('Дополнительно задание D.')

bbb=int((gradient[0][1]+gradient[1][1]+gradient[2][1])*60)
import datetime
print('Общее время составляет: ',datetime.timedelta(seconds=bbb))

"""# Пункт B.
# Есть словарь песен
# Распечатайте общее время звучания трех случайных песен
# Вывод: Три песни звучат ХХХ минут.

my_favorite_songs_dict = {
    'Waste a Moment': 3.03,
    'New Salvation': 4.02,
    'Staying\' Alive': 3.40,
    'Out of Touch': 3.03,
    'A Sorta Fairytale': 5.28,
    'Easy': 4.15,
    'Beautiful Day': 4.04,
    'Nowhere to Run': 2.58,
    'In This World': 4.02,
}
"""

my_favorite_songs_dict = {
    'Waste a Moment': 3.03,
    'New Salvation': 4.02,
    'Staying Alive': 3.40,
    'Out of Touch': 3.03,
    'A Sorta Fairytale': 5.28,
    'Easy': 4.15,
    'Beautiful Day': 4.04,
    'Nowhere to Run': 2.58,
    'In This World': 4.02, }

import random
zzz = random.sample(list(my_favorite_songs_dict.items()),3)

print('Список песен: ', zzz)
gradient=zzz
print('Три песни звучат: ',gradient[0][1],'+',gradient[1][1],'+',gradient[2][1],'=',round((gradient[0][1]+gradient[1][1]+gradient[2][1]),2),' минут')

print('Дополнительно задание D.')

ccc=int((gradient[0][1]+gradient[1][1]+gradient[2][1])*60)
import datetime
print('Общее время составляет: ',datetime.timedelta(seconds=ccc))

"""# Пункт C.
# Сгенерируйте случайные песни с помощью модуля random
# import random

"""

print('Выполнено в A и B')

"""# Дополнительно
# Пункт D.
# Переведите минуты и секунды в формат времени. Используйте модуль datetime
"""

print('Выполнено в A и B')